uhnp/src/InformationRegisters/тн_НастройкиЗаполненияДокументовПоЭДО/тн_НастройкиЗаполненияДокументовПоЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_НастройкиЗаполненияДокументовПоЭДО</name>
  <comment>// Мещеряков Алексей 28.11.2023 Выполнение задач №000047617</comment>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеПолучатель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Статья</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяРекласификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеУУ</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяУУ</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>Действующая</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_НастройкиЗаполненияДокументовПоЭДО/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ТребуетсяРеклассификацияПриИзмененииНаСервере()
	ЗаписьРегистра = РеквизитФормыВЗначение("Запись");
	Если ЗаписьРегистра.ТребуетсяРекласификация Тогда
		Если Не ЗначениеЗаполнено(ЗаписьРегистра.ПодразделениеУУ) 
			Или Не ЗначениеЗаполнено(ЗаписьРегистра.СтатьяУУ) Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Для установки флага ""Реклассификации"" необходимо заполнить поля ""СтатьяУУ"" и ""ПодразделениеУУ"" ");
		
	    КонецЕсли;
	КонецЕсли;
	ЗначениеВРеквизитФормы(ЗаписьРегистра,"Запись");
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяРеклассификацияПриИзменении(Элемент)
	ТребуетсяРеклассификацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Запись.ПодразделениеПолучатель) 
		Или Не ЗначениеЗаполнено(Запись.Статья) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Поля ""Подразделение-получатель и Статья "" обязательны к заполнению.");		
	КонецЕсли; 
		
	Если Запись.Действующая Тогда
		Отказ = ЕстьДействующаяЗапись(Запись);
	КонецЕсли;
	
	Если Запись.ТребуетсяРекласификация Тогда
		Если Не ЗначениеЗаполнено(Запись.ПодразделениеУУ) 
			Или Не ЗначениеЗаполнено(Запись.СтатьяУУ) Тогда

			ОбщегоНазначения.СообщитьПользователю("Для установки флага ""Реклассификации"" необходимо заполнить поля ""СтатьяУУ"" и ""ПодразделениеУУ"" ");
		    Отказ = Истина;
	    КонецЕсли;
	КонецЕсли;

		
КонецПроцедуры

Функция ЕстьДействующаяЗапись(Запись)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	тн_НастройкиЗаполненияДокументовПоЭДО.Контрагент КАК Контрагент,
	               |	тн_НастройкиЗаполненияДокументовПоЭДО.Организация КАК Организация,
	               |	тн_НастройкиЗаполненияДокументовПоЭДО.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.тн_НастройкиЗаполненияДокументовПоЭДО КАК тн_НастройкиЗаполненияДокументовПоЭДО
	               |ГДЕ
	               |	тн_НастройкиЗаполненияДокументовПоЭДО.Контрагент = &Контрагент
	               |	И тн_НастройкиЗаполненияДокументовПоЭДО.Организация = &Организация
	               |	И тн_НастройкиЗаполненияДокументовПоЭДО.Действующая = ИСТИНА
	               |	И тн_НастройкиЗаполненияДокументовПоЭДО.Номенклатура <> &Номенклатура";
	
	Запрос.УстановитьПараметр("Контрагент",Запись.Контрагент);
	Запрос.УстановитьПараметр("Организация",Запись.Организация); 
	Запрос.УстановитьПараметр("Номенклатура",Запись.Номенклатура);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат Ложь;
	Иначе 
		ОбщегоНазначения.СообщитьПользователю("По данному контрагенту и организации уже существует действующая запись. Снимите флаг с записи и установите на новой.");		
		Возврат Истина;
	КонецЕсли;	
		
КонецФункции
